import numpy as np

# 2次元配列
b = np.array([[1, 2, 3], [4, 5, 6]])
print(b)

"""
実行結果
[[1 2 3] 
 [4 5 6]]
"""

print(b[1, 0])
"""
実行結果
4
"""

# スライス
print(b[:, 2])
"""
実行結果
[3 6]
"""

print(b[1, :])
"""
実行結果
[4 5 6]
"""

# データの再代入
b = np.array([[1, 2, 3], [4, 5, 6]])
b[1, 2] = 7
print(b)
"""
実行結果
[[1 2 3]
 [4 5 7]]
"""

b[:, 2] = 8
print(b)
"""
実行結果
[[1 2 8]
 [4 5 8]]
"""

print(end='\n')

#------------------------------------#
# 確認試験 #
print(np.array([1, 2, 3], dtype="float"))
"""
実行結果
[1. 2. 3.]
"""

print(end='\n')

c = np.array([[1], [2], [3]])
print(c)
"""
実行結果
[[1]
 [2]
 [3]]
"""

print(end='\n')

a = np.array([[1, 2, 3], [2, 3, 4], [3, 4, 5]])
print(a[1:])
"""
実行結果
[[2 3 4]
 [3 4 5]]
"""

print(end='\n')

a = np.array([[[1, 2, 3]], [[2, 3, 4]], [[3, 4, 5]]])
print(a)
a[:, :,  2] = 1
print(a)
a[:, 2] = 2
print(a)
"""
実行結果
[[[1 2 1]]

 [[2 3 1]]

 [[3 4 1]]]
"""

print(end='\n')

a = np.array([1, 2, 3, 5, 8, 13])
print(a[4])
"""
実行結果
8
"""
